tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/services"
tap "mongodb/brew"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Text processing system for reStructuredText
brew "docutils"
# Official Amazon AWS command-line interface
brew "awscli"
# Validate CloudFormation templates against the CloudFormation spec
brew "cfn-lint"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3", link: false
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Enables extra languages support for Tesseract
brew "tesseract-lang"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# AdoptOpenJDK OpenJDK (Java) Development Kit
cask "adoptopenjdk11"
# AdoptOpenJDK OpenJDK (Java) Development Kit
cask "adoptopenjdk8"
vscode "christian-kohler.npm-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "GitHub.copilot"
vscode "GitHub.github-vscode-theme"
vscode "GitHub.vscode-pull-request-github"
vscode "Gruntfuggly.todo-tree"
vscode "KevinRose.vsc-python-indent"
vscode "mgesbert.python-path"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.live-server"
vscode "ritwickdey.LiveServer"
vscode "streetsidesoftware.code-spell-checker"
vscode "ThreadHeap.serverless-ide-vscode"
vscode "Tyriar.luna-paint"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "wix.vscode-import-cost"
